src/test/resources/data/readable/PRPA_IN000202UK01/Sanitized/envelope.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:xsi="http://www.w3c.org/2001/XML-Schema-Instance"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
               xmlns:xlink="http://www.w3.org/1999/xlink">
    <soap:Header>
        <eb:MessageHeader eb:version="2.0" soap:mustUnderstand="1">
            <eb:From>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">YES-0000806</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">B86041-822103</eb:PartyId>
            </eb:To>
            <eb:CPAId>82e0f4374fb8a0a57522</eb:CPAId>
            <eb:ConversationId>723c5f3a-1ab8-4515-a582-3e5cc600bf59</eb:ConversationId>
            <eb:Service>urn:nhs:names:services:pds</eb:Service>
            <eb:Action>PRPA_IN000202UK01</eb:Action>
            <eb:MessageData>
                <eb:MessageId>11F4D7DF-EB49-45A5-A310-59FFFCF98C2A</eb:MessageId>
                <eb:Timestamp>2021-05-05T08:23:36Z</eb:Timestamp>
                <eb:RefToMessageId>2B41980B-690A-4463-B14D-E96E7D24B4DC</eb:RefToMessageId>
            </eb:MessageData>
            <eb:DuplicateElimination/>
        </eb:MessageHeader>
        <eb:AckRequested eb:version="2.0" soap:mustUnderstand="1"
                         soap:actor="urn:oasis:names:tc:ebxml-msg:actor:toPartyMSH" eb:signed="false"/>
        <eb:SyncReply eb:version="2.0" soap:mustUnderstand="1" soap:actor="http://schemas.xmlsoap.org/soap/actor/next"/>
    </soap:Header>
    <soap:Body>
        <eb:Manifest xmlns:hl7ebxml="urn:hl7-org:transport/ebXML/DSTUv1.0" eb:version="2.0">
            <eb:Reference xlink:href="cid:11F4D7DF-EB49-45A5-A310-59FFFCF98C2A@spine.nhs.uk">
                <eb:Schema eb:location="urn:hl7-org:v3_PRPA_IN000202UK01.xsd" eb:version="01"/>
                <eb:Description xml:lang="en">The HL7 payload</eb:Description>
                <hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
            </eb:Reference>
        </eb:Manifest>
    </soap:Body>
</soap:Envelope>
